## Plan 📝
```bash
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/apsitvarkom-staging/locations/us-east1/repositories/docker-apsitvarkom-staging]
google_service_account.ga_cd_account: Refreshing state... [id=projects/apsitvarkom-staging/serviceAccounts/ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]
google_storage_bucket.terraform_state_bucket: Refreshing state... [id=apsitvarkom-staging-bucket-tfstate]
google_service_account.postgresql_vm_account: Refreshing state... [id=projects/apsitvarkom-staging/serviceAccounts/postgresql-vm@apsitvarkom-staging.iam.gserviceaccount.com]
google_project_iam_member.cloud_run_admin_ga_cd_binding: Refreshing state... [id=apsitvarkom-staging/roles/run.admin/serviceAccount:ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]
google_project_iam_member.token_creator_ga_cd_binding: Refreshing state... [id=apsitvarkom-staging/roles/iam.serviceAccountTokenCreator/serviceAccount:ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]
google_project_iam_member.service_account_user_ga_cd_binding: Refreshing state... [id=apsitvarkom-staging/roles/iam.serviceAccountUser/serviceAccount:ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]
google_project_iam_member.artifact_registry_repo_admin_ga_cd_binding: Refreshing state... [id=apsitvarkom-staging/roles/artifactregistry.repoAdmin/serviceAccount:ga-delivery@apsitvarkom-staging.iam.gserviceaccount.com]
google_compute_instance.postgresql: Refreshing state... [id=projects/apsitvarkom-staging/zones/us-east1-b/instances/postgresql]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.postgresql will be created
  + resource "google_compute_instance" "postgresql" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            sudo apt update
            sudo apt -y install postgresql postgresql-client postgresql-contrib
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "postgresql"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags                    = [
          + "postgresql",
        ]
      + tags_fingerprint        = (known after apply)
      + zone                    = "us-east1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2204-lts"
              + labels = (known after apply)
              + size   = 20
              + type   = "pd-standard"
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = "STANDARD"
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = "postgresql-vm@apsitvarkom-staging.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentplan -->